"use strict";

/**
 * Created by VictorJin on 2017/12/22.
 */
var express = require("express");

var app = express();

var db = [{
    "title": "1号",
    "shijian": "昨天",
    "zuozhe": "VictorJin",
    "neirong": "<p>内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容</p>"
}, {
    "title": "2号",
    "shijian": "昨天",
    "zuozhe": "VictorJin",
    "neirong": "<p>内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容</p>"
}, {
    "title": "3号",
    "shijian": "昨天",
    "zuozhe": "VictorJin",
    "neirong": "<p>内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容</p>"
}, {
    "title": "4号",
    "shijian": "昨天",
    "zuozhe": "VictorJin",
    "neirong": "<p>内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容</p>"
}, {
    "title": "5号",
    "shijian": "昨天",
    "zuozhe": "VictorJin",
    "neirong": "<p>内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容内容</p>"
}];

app.set("view engine", "ejs");

app.get("/new/:id", function (req, res) {
    var id = req.params.id;
});

app.listen(3000, function () {
    console.log("server start");
});
//# sourceMappingURL=app.js.map